DocumentJournals/ДМ_ЗагруженныеФайлыОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DocumentJournal>
		<Properties>
			<Name>ДМ_ЗагруженныеФайлыОбмена</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ДМ_ФайлыОбменаDanoneКлиент</xr:Item>
				<xr:Item>Document.ДМ_ФайлыОбменаDanoneВнутреннееПеремещение</xr:Item>
				<xr:Item>Document.ДМ_ФайлыОбменаDanoneГашениеВСД</xr:Item>
				<xr:Item>Document.ДМ_ФайлыОбменаDanoneСторнированиеОтгрузки</xr:Item>
				<xr:Item>Document.ДМ_ФайлыОбменаDanoneПроизводство</xr:Item>
				<xr:Item>Document.ДМ_ФайлыОбменаDanoneИнвентаризация</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Ответственный</Name>
					<References>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneКлиент.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneВнутреннееПеремещение.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneГашениеВСД.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneСторнированиеОтгрузки.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneПроизводство.Attribute.Ответственный</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneИнвентаризация.Attribute.Ответственный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДатаЗагрузкиИсходногоФайла</Name>
					<References>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneКлиент.Attribute.ДатаЗагрузкиИсходногоФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneВнутреннееПеремещение.Attribute.ДатаЗагрузкиИсходногоФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneГашениеВСД.Attribute.ДатаЗагрузкиИсходногоФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneСторнированиеОтгрузки.Attribute.ДатаЗагрузкиИсходногоФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneПроизводство.Attribute.ДатаЗагрузкиИсходногоФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneИнвентаризация.Attribute.ДатаЗагрузкиИсходногоФайла</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДатаЗаписиОбработанногоФайла</Name>
					<References>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneКлиент.Attribute.ДатаЗаписиОбработанногоФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneВнутреннееПеремещение.Attribute.ДатаЗаписиОбработанногоФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneГашениеВСД.Attribute.ДатаЗаписиОбработанногоФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneСторнированиеОтгрузки.Attribute.ДатаЗаписиОбработанногоФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneПроизводство.Attribute.ДатаЗаписиОбработанногоФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneИнвентаризация.Attribute.ДатаЗаписиОбработанногоФайла</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Hash</Name>
					<References>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneКлиент.Attribute.Hash</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneВнутреннееПеремещение.Attribute.Hash</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneГашениеВСД.Attribute.Hash</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneСторнированиеОтгрузки.Attribute.Hash</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneПроизводство.Attribute.Hash</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneИнвентаризация.Attribute.Hash</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ИмяФайла</Name>
					<References>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneКлиент.Attribute.ИмяФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneВнутреннееПеремещение.Attribute.ИмяФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneГашениеВСД.Attribute.ИмяФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneСторнированиеОтгрузки.Attribute.ИмяФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneПроизводство.Attribute.ИмяФайла</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneИнвентаризация.Attribute.ИмяФайла</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СтатусДокумента</Name>
					<References>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneКлиент.Attribute.СтатусДокумента</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneВнутреннееПеремещение.Attribute.СтатусДокумента</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneГашениеВСД.Attribute.СтатусДокумента</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneСторнированиеОтгрузки.Attribute.СтатусДокумента</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneПроизводство.Attribute.СтатусДокумента</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneИнвентаризация.Attribute.СтатусДокумента</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Кодировка</Name>
					<References>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneКлиент.Attribute.Кодировка</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneВнутреннееПеремещение.Attribute.Кодировка</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneГашениеВСД.Attribute.Кодировка</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneСторнированиеОтгрузки.Attribute.Кодировка</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneПроизводство.Attribute.Кодировка</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneИнвентаризация.Attribute.Кодировка</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneКлиент.Attribute.Организация</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneВнутреннееПеремещение.Attribute.Организация</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneГашениеВСД.Attribute.Организация</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneПроизводство.Attribute.Организация</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneИнвентаризация.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Предприятие</Name>
					<References>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneКлиент.Attribute.Предприятие</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneВнутреннееПеремещение.Attribute.Предприятие</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneГашениеВСД.Attribute.Предприятие</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneПроизводство.Attribute.Предприятие</xr:Item>
						<xr:Item>Document.ДМ_ФайлыОбменаDanoneИнвентаризация.Attribute.Предприятие</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

InformationRegisters/ПредприятияОбслуживаемыеПользователем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПредприятияОбслуживаемыеПользователем</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиСистемыМеркурий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусДокументаСФайламиSAP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СтатусДокументаСФайламиSAP</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УспешноОбработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПриОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыбранВСДДляГашения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DocumentJournals/ДМ_ЗагруженныеФайлыОбмена/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		
		ДоступныВсеПредприятия = Ложь;
		
		Попытка
			
			УстановитьПривилегированныйРежим(Истина);
			
			ПользМеркурий = Пользователи.ТекущийПользователь().ПользовательСистемыМеркурий;
			
			ЗапрМП = Новый Запрос;
			ЗапрМП.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ПредприятияОбслуживаемыеПользователемСрезПоследних.Предприятие КАК Предприятие
			               |ИЗ
			               |	РегистрСведений.ПредприятияОбслуживаемыеПользователем.СрезПоследних КАК ПредприятияОбслуживаемыеПользователемСрезПоследних
			               |ГДЕ
			               |	ПредприятияОбслуживаемыеПользователемСрезПоследних.Пользователь = &ПользМеркурий
			               |	И ПредприятияОбслуживаемыеПользователемСрезПоследних.Используется = ИСТИНА";
			
			
			ЗапрМП.Параметры.Вставить("ПользМеркурий",ПользМеркурий);
			ВыбЗапрМП = ЗапрМП.Выполнить().Выбрать();
			Пока ВыбЗапрМП.Следующий() Цикл
				СписокДоступныхПредприятий.Добавить(ВыбЗапрМП.Предприятие);
			КонецЦикла;	
			
			УстановитьПривилегированныйРежим(Ложь);
			
		Исключение	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для пользователя " + Пользователи.ТекущийПользователь() + " не назначен пользователь
			| в системе Меркурий");
			Отказ = Истина;
		КонецПопытки;	
		
	Иначе
		
		ДоступныВсеПредприятия = Истина;
		
	КонецЕсли;	
	
	
	Если РольДоступна("HelpDesk") Тогда
		Если НЕ ДоступныВсеПредприятия Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, 
			"Предприятие",
			СписокДоступныхПредприятий,
			ВидСравненияКомпоновкиДанных.ВСписке,
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
		КонецЕсли;
	ИначеЕсли Не РольДоступна("ПолныеПрава") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Предприятие",
		СписокДоступныхПредприятий,
		ВидСравненияКомпоновкиДанных.ВСписке,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		//	Список, 
		//	"Организация",
		//	мСписокО,
		//	ВидСравненияКомпоновкиДанных.ВСписке,
		//	,
		//	Истина,
		//	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"СтатусДокумента",
		Перечисления.СтатусДокументаСФайламиSAP.УспешноОбработан,
		ВидСравненияКомпоновкиДанных.НеРавно,
		,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	
КонецПроцедуры
